In [1]:
import pandas as pd

In [5]:
customers = pd.read_csv('Customer.csv')
prod_cats = pd.read_csv('prod_cat_info.csv')
transactions = pd.read_csv('Transactions.csv')

In [6]:
customers.head()

   customer_Id         DOB Gender  city_code
0       268408  02-01-1970      M        4.0
1       269696  07-01-1970      F        8.0
2       268159  08-01-1970      F        8.0
3       270181  10-01-1970      F        2.0
4       268073  11-01-1970      M        1.0

In [7]:
prod_cats.head()

   prod_cat_code  prod_cat  prod_sub_cat_code prod_subcat
0              1  Clothing                  4        Mens
1              1  Clothing                  1       Women
2              1  Clothing                  3        Kids
3              2  Footwear                  1        Mens
4              2  Footwear                  3       Women

In [8]:
transactions.head()

,transaction_id,cust_id,tran_date,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,Store_type
0,80712190438,270351,28-02-2014,1,1,-5,-772,405.300,-4265.300,e-Shop
1,29258453508,270384,27-02-2014,5,3,-5,-1497,785.925,-8270.925,e-Shop
2,51750724947,273420,24-02-2014,6,5,-2,-791,166.110,-1748.110,TeleShop
3,93274880719,271509,24-02-2014,11,6,-3,-1363,429.345,-4518.345,e-Shop
4,51750724947,273420,23-02-2014,6,5,-2,-791,166.110,-1748.110,TeleShop

### Exploratory Data Analysis

In [10]:
print(customers.shape)
print(prod_cats.shape)
print(transactions.shape)

(5647, 4)
(23, 4)
(23053, 10)

In [12]:
customers.dtypes

customer_Id      int64
DOB             object
Gender          object
city_code      float64
dtype: object

In [13]:
prod_cats.dtypes

prod_cat_code         int64
prod_cat             object
prod_sub_cat_code     int64
prod_subcat          object
dtype: object

In [14]:
transactions.dtypes

transaction_id        int64
cust_id               int64
tran_date            object
prod_subcat_code      int64
prod_cat_code         int64
Qty                   int64
Rate                  int64
Tax                 float64
total_amt           float64
Store_type           object
dtype: object

In [19]:
# Changing data type of customer's DOB from object to datetime

customers['DOB'] = pd.to_datetime(customers['DOB'], format = '%d-%m-%Y')
customers.head()

   customer_Id        DOB Gender  city_code
0       268408 1970-02-01      M        4.0
1       269696 1970-07-01      F        8.0
2       268159 1970-08-01      F        8.0
3       270181 1970-10-01      F        2.0
4       268073 1970-11-01      M        1.0

In [20]:
customers.dtypes

customer_Id             int64
DOB            datetime64[ns]
Gender                 object
city_code             float64
dtype: object

In [27]:
# Changing data type of transaction's tran_date from object to datetime

transactions['tran_date'] = transactions['tran_date'].str.replace('/', '-')
transactions['tran_date'] = pd.to_datetime(transactions['tran_date'], format = '%d-%m-%Y')
transactions.head()

,transaction_id,cust_id,tran_date,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,Store_type
0,80712190438,270351,2014-02-28,1,1,-5,-772,405.300,-4265.300,e-Shop
1,29258453508,270384,2014-02-27,5,3,-5,-1497,785.925,-8270.925,e-Shop
2,51750724947,273420,2014-02-24,6,5,-2,-791,166.110,-1748.110,TeleShop
3,93274880719,271509,2014-02-24,11,6,-3,-1363,429.345,-4518.345,e-Shop
4,51750724947,273420,2014-02-23,6,5,-2,-791,166.110,-1748.110,TeleShop

In [28]:
transactions.dtypes

transaction_id               int64
cust_id                      int64
tran_date           datetime64[ns]
prod_subcat_code             int64
prod_cat_code                int64
Qty                          int64
Rate                         int64
Tax                        float64
total_amt                  float64
Store_type                  object
dtype: object

### 1. Merge the datasets Customers, Product Hierarchy and Transactions as Customer_Final. Ensure to keep all customers who have done transactions with us and select the join type accordingly.

In [30]:
cust_tran = pd.merge(left = customers, right = transactions, left_on = 'customer_Id', right_on = 'cust_id', how = 'left')

In [37]:
Customer_Final = pd.merge(left = cust_tran, right = prod_cats, left_on = ['prod_subcat_code', 'prod_cat_code'], right_on = ['prod_sub_cat_code', 'prod_cat_code'], how = 'left')

In [39]:
Customer_Final.duplicated().sum()

13

In [40]:
Customer_Final.drop_duplicates(inplace = True)

In [41]:
Customer_Final.duplicated().sum()

0